import { IDateInterval } from "../types";

export const periodsData: IDateInterval[] = [
  { start: 1980, end: 1986 },
  { start: 1987, end: 1991 },
  { start: 1992, end: 1997 },
  { start: 1999, end: 2004 },
  { start: 2006, end: 2014 },
  { start: 2015, end: 2022 },
];

export const eventsData = [
  [
    {
      year: 1980,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1981,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1983,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1984,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1986,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  [
    {
      year: 1987,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1988,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1989,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1990,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1991,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  [
    {
      year: 1992,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1993,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1994,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1996,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1997,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  [
    {
      year: 1999,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2000,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2001,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2002,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2003,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  [
    {
      year: 2006,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2007,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2009,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2011,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2012,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  [
    {
      year: 2015,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2016,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2018,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2020,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2021,
      event:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
];
