import { IDateInterval } from "../types";

export const periodsData: IDateInterval[] = [
  { start: 1980, end: 1986 },
  { start: 1987, end: 1991 },
  { start: 1992, end: 1997 },
  { start: 1999, end: 2004 },
  { start: 2006, end: 2014 },
  { start: 2015, end: 2022 },
];

export const eventsData = {
  periods1: [
    {
      time: 1980,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1981,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1983,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1984,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1986,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  periods2: [
    {
      time: 1987,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1988,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1989,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1990,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1991,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  periods3: [
    {
      time: 1992,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1993,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1994,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1996,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 1997,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  periods4: [
    {
      time: 1999,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2000,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2001,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2002,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2003,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  periods5: [
    {
      time: 2006,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2007,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2009,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2011,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2012,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  periods6: [
    {
      time: 2015,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2016,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2018,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2020,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      time: 2021,
      events:
        "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
};
